Revit 2027 API
ExternalResourceUtils.GetAllExternalResourceReferences Method
Overload List
Name | Description
GetAllExternalResourceReferences(Document) |  Gets the ids of all elements which refer to external resources.
GetAllExternalResourceReferences(Document, ExternalResourceType) |  Gets the ids of all elements which refer to a specific type of external resource.
Top
See Also
Reference
ExternalResourceUtils Class
Autodesk.Revit.DB Namespace